servicetemplates/http%3A%2F%2Fopentosca.org%2Fservicetemplates/MyTinyToDo_Bare_Docker/SELFSERVICE-Metadata/option_MyTinyToDo_Bare_Docker_scalingPlan_scaleout_dockercontainerService_plan.input.xml

<soapenv:Envelope xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:org="http://opentosca.org/servicetemplates_scalingPlan"><soapenv:Header><wsa:ReplyTo><wsa:Address>%CALLBACK-URL%</wsa:Address></wsa:ReplyTo><wsa:Action>http://opentosca.org/servicetemplates_scalingPlan/initiate</wsa:Action><wsa:MessageID>%CORRELATION-ID%</wsa:MessageID></soapenv:Header><soapenv:Body><org:MyTinyToDo_Bare_Docker_scalingPlan_scaleout_dockercontainerRequest><org:instanceDataAPIUrl>%INSTANCEDATA-URL%</org:instanceDataAPIUrl><org:OpenTOSCAContainerAPIServiceInstanceURL>Please fill in</org:OpenTOSCAContainerAPIServiceInstanceURL><org:CorrelationID>%CORRELATION-ID%</org:CorrelationID><org:ApplicationPort>Please fill in</org:ApplicationPort><org:ContainerSSHPort>Please fill in</org:ContainerSSHPort><org:csarEntrypoint>%CSARENTRYPOINT-URL%</org:csarEntrypoint></org:MyTinyToDo_Bare_Docker_scalingPlan_scaleout_dockercontainerRequest></soapenv:Body></soapenv:Envelope>